
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>渲染的那些事(服务端、前端、预渲染、webpack多入口) · 记录</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="chaofan">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    学习、思考
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="RenderPage.html">
            
                <a href="RenderPage.html">
            
                    
                    渲染的那些事(服务端、前端、预渲染、webpack多入口)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <a target="_blank" href="http://wuchaofan.github.io/b/menu-sticky.html">
            
                    
                    吸顶 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="RN_vs_flutter.html">
            
                <a href="RN_vs_flutter.html">
            
                    
                    React Native vs Flutter
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Swift_Flutter.html">
            
                <a href="Swift_Flutter.html">
            
                    
                    Swift与Flutter
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="FlutterCase.html">
            
                <a href="FlutterCase.html">
            
                    
                    Flutter UI demo
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Sentry.html">
            
                <a href="Sentry.html">
            
                    
                    搭建sentry以及sourcemap
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <a target="_blank" href="http://wuchaofan.github.io/2017summary.html">
            
                    
                    2017总结及趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <a target="_blank" href="http://wuchaofan.github.io/sw.html">
            
                    
                    Service Worker
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <a target="_blank" href="https://github.com/wuchaofan/pages/issues">
            
                    
                    Github随笔 >
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" >
            
                <a target="_blank" href="http://wuchaofan.github.io/docker.html">
            
                    
                    自制Docker
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" >
            
                <a target="_blank" href="http://wuchaofan.github.io/b/filesystem.html">
            
                    
                    自制文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" >
            
                <a target="_blank" href="http://wuchaofan.github.io/study.html">
            
                    
                    以前的记录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" >
            
                <a target="_blank" href="http://wuchaofan.github.io/demo/d/index.html">
            
                    
                    以前的小Demo
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" >
            
                <a target="_blank" href="http://wuchaofan.github.io/g/bridge/index.html">
            
                    
                    独木桥小游戏
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >渲染的那些事(服务端、前端、预渲染、webpack多入口)</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x6E32;&#x67D3;&#x7684;&#x90A3;&#x4E9B;&#x4E8B;&#x670D;&#x52A1;&#x7AEF;&#x3001;spa&#x3001;&#x9884;&#x6E32;&#x67D3;&#x3001;&#x591A;&#x9875;">&#x6E32;&#x67D3;&#x7684;&#x90A3;&#x4E9B;&#x4E8B;(&#x670D;&#x52A1;&#x7AEF;&#x3001;spa&#x3001;&#x9884;&#x6E32;&#x67D3;&#x3001;&#x591A;&#x9875;)</h3>
<p>&#x7531;&#x4E8E;&#x7535;&#x5546;&#x5E73;&#x53F0;&#x7684;&#x7279;&#x6B8A;&#x6027;&#xFF0C;&#x5373;&#x8981;&#x6709;&#x5B9E;&#x65F6;&#x6E32;&#x67D3;&#x51FA;&#x6765;&#x7684;&#x5546;&#x54C1;&#x9875;&#x9762;&#x3001;&#x53C8;&#x8981;&#x6709;&#x6D3B;&#x52A8;&#x9875;&#x3001;&#x5E7F;&#x544A;&#x9875;&#x8FD9;&#x79CD;&#x9759;&#x6001;&#x9875;&#x9762;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x591A;&#x8BED;&#x8A00;&#x56FD;&#x9645;&#x5316;&#x652F;&#x6301;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x54EA;&#x4E00;&#x79CD;&#x6E32;&#x67D3;&#x5FC5;&#x987B;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x3002;</p>
<h4 id="1&#x3001;&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;&#xFF08;ssr&#xFF09;">1&#x3001;&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;&#xFF08;ssr&#xFF09;</h4>
<p>&#x200B;        &#x5BF9;&#x4E8E;&#x52A8;&#x6001;&#x9875;&#x9762;&#xFF0C;&#x4EE5;&#x524D;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x8BED;&#x8A00;&#x4F7F;&#x7528;asp&#x3001;jsp&#x3001;php&#x3001;ejs&#x3001;jade&#x7B49;&#x7B49;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x7248;&#x5F15;&#x64CE;&#x5BF9;&#x540E;&#x7AEF;&#x8026;&#x5408;&#x6027;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x5BF9;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5F88;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x524D;&#x540E;&#x5206;&#x79BB;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#xFF0C;&#x524D;&#x540E;&#x5206;&#x79BB;&#x540E;&#xFF0C;&#x540E;&#x7AEF;&#x53EA;&#x63D0;&#x4F9B;API&#x7B49;&#x670D;&#x52A1;&#xFF0C;&#x4F18;&#x70B9;&#x662F;&#x5206;&#x5DE5;&#x660E;&#x786E;&#x3001;&#x7EF4;&#x62A4;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x3001;&#x4E5F;&#x5229;&#x4E8E;&#x4EE3;&#x7801;&#x8FC1;&#x79FB;&#x3002;</p>
<p>&#x200B;       &#x90A3;&#x4E48;&#x524D;&#x540E;&#x5206;&#x79BB;&#x540E;&#x4E3A;&#x4F55;&#x9700;&#x8981;ssr&#x5462;&#xFF0C;&#x9996;&#x5148;&#x8BF4;&#x8BF4;spa&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x4E0D;&#x5229;&#x4E8E;SEO&#xFF0C;&#x56E0;&#x4E3A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4E0D;&#x4F1A;&#x6267;&#x884C;js&#x4EE3;&#x7801;&#xFF0C;&#x505A;&#x4E0D;&#x5230;&#x4E0D;&#x540C;&#x9875;&#x9762;&#x7684;head&#x7684;meta&#x4E2D;&#x5305;&#x542B;&#x5229;&#x4E8E;SEO&#x7684;&#x4FE1;&#x606F;&#xFF1B;&#x5176;&#x6B21;&#x52A0;&#x8F7D;&#x6E32;&#x67D3;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x6709;&#x52A0;&#x8F7D;js&#x6267;&#x884C;&#x540E;&#x624D;&#x80FD;&#x8BF7;&#x6C42;&#x5FC5;&#x8981;&#x7684;api&#x63A5;&#x53E3;&#x7B49;&#xFF0C;&#x5BFC;&#x81F4;&#x6E32;&#x67D3;&#x5EF6;&#x8FDF;&#x3002;&#x5982;&#x679C;&#x7F51;&#x7AD9;&#x9700;&#x8981;&#x8003;&#x8651;&#x8FD9;&#x4E24;&#x79CD;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#xFF0C;ssr&#x662F;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;ssr&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x628A;&#x5FC5;&#x8981;&#x7684;&#x8BF7;&#x6C42;&#x7B49;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#xFF0C;&#x518D;&#x628A;web&#x9875;&#x9762;&#x4F20;&#x8F93;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x505A;&#x5230;&#x4E0D;&#x540C;&#x7684;head&#x4EE5;&#x53CA;&#x9996;&#x5C4F;&#x7684;&#x6E32;&#x67D3;&#x901F;&#x5EA6;&#x4E86;&#x3002;&#x524D;&#x540E;&#x5F00;&#x53D1;&#x4EE3;&#x7801;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#x3002;</p>
<p>&#x200B;        &#x5F53;&#x7136;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8981;&#x6CE8;&#x610F;&#x7684;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x8FD0;&#x884C;&#x7EC4;&#x4EF6;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x62FF;&#x5230;window&#x7B49;&#x6D4F;&#x89C8;&#x5668;&#x6570;&#x636E;&#x53CA;&#x6D4F;&#x89C8;&#x5668;&#x63A5;&#x53E3;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x64CD;&#x4F5C; DOM&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x5982;vue&#x4E2D;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E5F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6E32;&#x67D3;&#x76F8;&#x5173;&#x7684;&#x5904;&#x7406;&#x670D;&#x52A1;&#x7AEF;&#x4E0D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#xFF0C;&#x6BD4;&#x5982;mounted&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x53EA;&#x6709;<code>beforeCreate</code>&#x3001;<code>created</code>&#x94A9;&#x5B50;&#xFF0C;&#x800C;&#x4E14;&#x5728;<code>beforeCreate</code>&#x3001;<code>created</code>&#x5199;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E24;&#x4E2A;&#x94A9;&#x5B50;&#x4E2D;&#x6709;setTimeout&#xFF0C;&#x7136;&#x800C;&#x670D;&#x52A1;&#x7AEF;&#x5E76;&#x6CA1;&#x6709;<code>beforeDestroy</code> &#x6216; <code>destroyed</code>&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;clearTimeout&#x3002;</p>
<p>&#x200B;      &#x53E6;&#x5916;&#x5982;&#x679C;&#x7F51;&#x7AD9;&#x652F;&#x6301;&#x591A;&#x8BED;&#x8A00;&#xFF0C;&#x90A3;&#x4E48;ssr&#x4ECD;&#x7136;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x7FFB;&#x8BD1;&#x5305;&#x975E;&#x5E38;&#x5927;&#x65F6;&#xFF0C;&#x5168;&#x91CF;&#x52A0;&#x8F7D;&#x5DF2;&#x7ECF;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x52A0;&#x8F7D;&#x53CA;&#x6E32;&#x67D3;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x6839;&#x636E;&#x8BED;&#x8A00;&#x6309;&#x9700;&#x52A0;&#x8F7D;&#x7279;&#x5B9A;&#x7684;&#x8BED;&#x8A00;&#x5305;&#x4ECD;&#x7136;&#x5F88;&#x5927;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x6CA1;&#x6BCF;&#x6B21;&#x52A0;&#x8F7D;&#x7684;&#x53EA;&#x662F;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x7684;&#x67D0;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x8F7D;&#x6B64;&#x8BED;&#x8A00;&#x7684;&#x6240;&#x6709;&#x7FFB;&#x8BD1;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6B64;&#x9875;&#x9762;&#x6240;&#x7528;&#x5230;&#x7684;&#x7FFB;&#x8BD1;code&#x83B7;&#x53D6;&#x8FD9;&#x4E9B;&#x7FFB;&#x8BD1;&#x3002;</p>
<h4 id="2&#x3001;&#x5355;&#x9875;&#x9762;&#x5E94;&#x7528;&#xFF08;spa&#xFF09;">2&#x3001;&#x5355;&#x9875;&#x9762;&#x5E94;&#x7528;&#xFF08;SPA&#xFF09;</h4>
<p>&#x770B;&#x5B57;&#x9762;&#x610F;&#x601D;&#x6211;&#x5C31;&#x77E5;&#x9053;&#xFF0C;&#x524D;&#x7AEF;&#x4EE3;&#x7801;&#x57FA;&#x672C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;CRM&#x7CFB;&#x7EDF;&#xFF0C;&#x628A;&#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x5230;&#x524D;&#x7AEF;&#x540E;&#x5904;&#x7406;&#x7B2C;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x3001;&#x6E32;&#x67D3;&#x6162;&#x5916;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x64CD;&#x4F5C;&#x5F88;&#x6D41;&#x7545;&#xFF0C;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x6570;&#x636E;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;lazy&#x52A0;&#x8F7D;&#x76F8;&#x5BF9;&#x51CF;&#x5C11;&#x6BCF;&#x6B21;&#x8BF7;&#x6C42;&#x3002;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;spa&#x662F;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x524D;&#x63D0;&#x662F;&#x5BF9;&#x9996;&#x5C4F;&#x6E32;&#x67D3;&#x901F;&#x5EA6;&#x8981;&#x6C42;&#x4E0D;&#x9AD8;&#x548C;&#x5229;&#x4E8E;SEO&#x65B9;&#x9762;&#x4E0D;&#x505A;&#x4F18;&#x5316;&#x8003;&#x8651;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x3002;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x4E0A;&#x4E0D;&#x5FC5;&#x8BF4;&#xFF0C;&#x7EAF;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3002;</p>
<h4 id="3&#x3001;&#x9884;&#x6E32;&#x67D3;&#xFF08;prerender&#xFF09;">3&#x3001;&#x9884;&#x6E32;&#x67D3;&#xFF08;prerender&#xFF09;</h4>
<p>&#x200B;      &#x7531;&#x4E8E;SPA&#x9879;&#x76EE;&#x5F71;&#x54CD;&#x6E32;&#x67D3;&#x901F;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x90E8;&#x5206;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x6210;&#x9759;&#x6001;&#x9875;&#x9762;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x9700;&#x8981;nginx&#x989D;&#x5916;&#x914D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x4F7F;&#x7528;spa&#x53C8;&#x60F3;&#x52A0;&#x5FEB;&#x67D0;&#x4E9B;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x901F;&#x5EA6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x6240;&#x6709;&#x9875;&#x9762;&#x90FD;&#x60F3;&#x8981;&#x9884;&#x6E32;&#x67D3;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x591A;&#x9875;&#x6253;&#x5305;&#x3002;</p>
<p>&#x200B;     &#x9884;&#x6E32;&#x67D3;&#x539F;&#x7406;&#x662F;&#x4F7F;&#x7528;puppeteer&#x4EA7;&#x751F;&#x7684;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x3002;</p>
<h4 id="4&#x3001;&#x591A;&#x9875;&#x5E94;&#x7528;&#xFF08;multipages&#xFF09;">4&#x3001;&#x591A;&#x9875;&#x5E94;&#x7528;&#xFF08;multipages&#xFF09;</h4>
<p>&#x200B;       &#x5BF9;&#x4E8E;&#x5E7F;&#x544A;&#x9875;&#x3001;&#x6D3B;&#x52A8;&#x9875;&#x7B49;&#x6765;&#x8BF4;&#xFF0C;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x9700;&#x6C42;&#x5F00;&#x53D1;&#x4EA7;&#x751F;&#x5355;&#x72EC;&#x7684;&#x9759;&#x6001;&#x9875;&#x9762;&#x5373;&#x53EF;&#x3002;&#x9884;&#x6E32;&#x67D3;&#x7684;&#x65B9;&#x5F0F;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x4F9D;&#x8D56;router&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x9875;&#x65E0;&#x6CD5;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#xFF0C;&#x6240;&#x4EE5;CRM&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x7528;&#x591A;&#x9875;&#xFF0C;&#x9664;&#x975E;&#x9700;&#x8981;&#x670D;&#x52A1;&#x7AEF;&#x66F4;&#x591A;&#x7684;&#x652F;&#x6301;&#x3002;&#x591A;&#x9875;&#x914D;&#x7F6E;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#x66F4;&#x52A0;&#x72EC;&#x7ACB;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;build&#x6307;&#x5B9A;&#x7684;&#x9875;&#x9762;&#x3002;&#x5728;ssr&#x4E2D;&#x6211;&#x4EEC;&#x8BF4;&#x5230;&#x591A;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#xFF0C;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x76F4;&#x63A5;&#x4EA7;&#x751F;&#x5BF9;&#x5E94;&#x8BED;&#x8A00;&#x7684;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x3002;</p>
<p><a href="https://github.com/wuchaofan/multi-pages" target="_blank">&#x4F8B;&#x5B50;</a></p>
<h5 id="&#x6700;&#x540E;">&#x6700;&#x540E;</h5>
<p>&#x4E4B;&#x540E;&#x9644;&#x4E0A;&#x6BCF;&#x4E00;&#x79CD;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5C31;&#x50CF;&#x629B;&#x5F00;&#x573A;&#x666F;&#x8C08;&#x6846;&#x67B6;&#x6CA1;&#x6709;&#x7ED3;&#x8BBA;&#x4E00;&#x6837;&#xFF0C;&#x629B;&#x5F00;&#x5E94;&#x7528;&#x573A;&#x666F;&#x8BA8;&#x8BBA;&#x90A3;&#x79CD;&#x67B6;&#x6784;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x8981;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x53EF;&#x4EE5;&#x5206;&#x62C6;&#x4E0D;&#x540C;&#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x5373;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x6548;&#x7387;&#x4E5F;&#x51CF;&#x5C11;&#x4F9D;&#x8D56;&#xFF0C;&#x6BD4;&#x5982;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x5982;&#x679C;&#x7528;ssr&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5E7F;&#x544A;&#x9875;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5BF9;&#x4E8E;&#x53D1;&#x5E03;&#x7248;&#x672C;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#xFF0C;&#x4EE5;&#x4E3A;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 学习、思考">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"渲染的那些事(服务端、前端、预渲染、webpack多入口)","level":"1.2","depth":1,"next":{"title":"吸顶 ","level":"1.3","depth":1,"url":"http://wuchaofan.github.io/b/menu-sticky.html","ref":"http://wuchaofan.github.io/b/menu-sticky.html","articles":[]},"previous":{"title":"学习、思考","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"chaofan","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"记录","language":"zh-hans","gitbook":"*"},"file":{"path":"RenderPage.md","mtime":"2019-06-10T06:47:43.212Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-13T06:18:24.377Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

